Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: The XNOR gate will emit 1 only when there is not exactly one 1 input, while the Even Parity gate will emit 1 if there are an even number of 1 inputs.
ru_ru: Элемент Исключающее ИЛИ-НЕ будет давать на выходе 1, когда входов с единицей строго не один, тогда как элемент Чётность даст 1, когда входов с единицей чётное количество.

source: Each output will be 1 if its number matches the value currently received through the select input on the south; otherwise, its value will be either zero or floating, depending on the value of the Three-State?
ru_ru: Каждый из выходов может нести 1, если его номер совпадает со значением, принятым в данный момент на выбирающем входе на юге, в противном случае значение на его выходе будет либо нулевое, либо плавающее, в зависимости от значения атрибута Три состояния?

source: The table contains a column for each component in the selection.
ru_ru: Таблица содержит столбец для каждого компонента в выборке.

source: Or you can delete it altogether by selecting Delete from the Edit menu or pressing the Delete key.
ru_ru: Или же вы можете удалить его полностью, выбрав Удалить из меню Правка или нажав клавишу Delete.

source: Components built using Java can have such pins, though: Within the built-in libraries, the Memory library's RAM circuit contains a D pin that can act both as an input and as an output.
ru_ru: Правда, компоненты, построенные с использованием Java могут иметь такие контакты: компонент ОЗУ встроенной библиотеки Память содержит контакт D, который может выступать и в качестве входа, и в качестве выхода.

source: Clicking on a component supporting the Text Tool will display that component's attributes.
ru_ru: При нажатии на компонент, поддерживающий Инструмент Текст, будут отображены атрибуты компонента.

source: East edge (output, bit width matches Output Bits attribute)
ru_ru: Восточный край (выход, разрядность соответствует атрибуту Выходные биты)

source: The direction of the component (its output relative to its input).
ru_ru: Направление компонента (его выхода относительно его входа).

source: South edge, labeled rem (output, bit width matches Data Bits attribute)
ru_ru: Южный край, отмечен rem (выход, разрядность соответствует атрибуту Биты данных)

source: Next: The Window tab.
ru_ru: Далее: Вкладка Окно.

source: The split ends are indexed starting from 0 at the top (for a splitter facing east or west) or from 0 at the left/west (for a splitter facing north or south).
ru_ru: Разделённые концы нумерованы начиная с 0 наверху (для разветвителя, направленного на восток или запад) или с 0 слева/на западе (для разветвителя, направленного на север или юг).

source: /* Note that there are no instance variables.
ru_ru: /* Обратите внимание на то, что нет переменных экземпляра.

source: Show attribute halo: Specifies whether to draw the pale teal oval around the component or tool whose attributes are currently displayed in the attribute table.
ru_ru: Показывать ореол: определяет, нужно ли рисовать голубой овал вокруг компонента или инструмента, атрибуты которого в данный момент отображаются в таблице атрибутов.

source: /** Computes the next gray value in the sequence after prev.
ru_ru: /** Вычисляет следующее значение кода Грея в последовательности после предыдущего.

source: The component has a number of inputs on its west edge, with the first labeled 0 and the other numbered from there.
ru_ru: Компонент имеет несколько входов на его западном крае, с первым, отмеченным 0 и другими, отсчитываемыми оттуда.

source: In this example, the splitter splits an incoming value into multiple outgoing values.
ru_ru: В этом пример разветвитель разделяет входящее значение на несколько исходящих значений.

source: // Finally we propagate the output into the circuit.
ru_ru: // Наконец, мы передаём значение с выхода дальше в схему.

source: These inputs control how the flip-flop's value changes during the rising edge of the clock.
ru_ru: Эти входы управляют тем, как значение триггера меняется в момент срабатывания тактового входа.

source: Specifies what the additional bits in the output should be.
ru_ru: Определяет, какими должны быть дополнительные биты на выходе.

source: You can re-enable simulation using the Simulate menu's Simulation Enabled option.
ru_ru: Вы можете снова включить моделирование, используя пункт Моделирование включено из меню Моделировать.

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
ru_ru: Данная лицензия разрешает, безвозмездно, лицам, получившим копию данного программного обеспечения и сопутствующей документации (в дальнейшем именуемыми "Программное Обеспечение"), использовать Программное Обеспечение без ограничений, включая неограниченное право на использование, копирование, изменение, добавление, публикацию, распространение, сублицензирование и/или продажу копий Программного Обеспечения, также как и лицам, которым предоставляется данное Программное Обеспечение, при соблюдении следующих условий:

source: Opens an existing file as a project in a new window.
ru_ru: Открывает существующий файл как проект в новом окне.

source: If you use speed in conjunction with -tty, then after completing the simulation Logisim will display a summary of how quickly the circuit was simulated, such as:
ru_ru: Если вы используете speed в сочетании с -tty, то после завершения моделирования Logisim покажет информацию о том, как быстро была моделирована схема, например:

source: The configuration dialog box is described below.
ru_ru: Диалоговое окно настройки описано ниже.

source: c) If the modified program normally reads commands interactively
ru_ru: c) Если модифицированная программа обычно читает команды в интерактивном

source: A circuit can access the current values in ROM, but it cannot change them.
ru_ru: Схема может получать доступ к текущим значениям в ПЗУ, но не может менять их.

source: The priority encoder is designed so that a number of encoders can be daisy-chained to accommodate additional inputs.
ru_ru: Шифратор приоритетов разработан таким образом, что ряд шифраторов можно расположить гирляндой для обеспечения дополнительных входов.

source: Data Interface
ru_ru: Интерфейс данных

source: Select input: The value of this input determines which input on the west edge to route to the output on the east edge.
ru_ru: Выбирающий вход: значение этого входа определяет, какой вход на западном крае будет перенаправлен на выход на восточном крае.

source: Also, it indicates the radix (base) in which the component's multi-bit values will be logged; the radix does not have a significant effect on one-bit values.
ru_ru: Кроме того, в ней указывается основание, по которому многобитные значения компонента будут записываться; основание не влияет на однобитные значения.

source: All wires in Logisim are either horizontal or vertical.
ru_ru: Все провода в Logisim либо горизонтальные, либо вертикальные.

source: This pin is neither an input nor an output — the matching tunnels are simply connected transparently.
ru_ru: Этот контакт не является ни входом ни выходом - соответствующие тоннели просто прозрачно соединены.

source: Specifies what each bit of the output should be when the component is disabled (i.e., when the enable pin is 0).
ru_ru: Определяет, каким должен быть каждый бит выхода, когда компонент выключен (то есть когда на контакте Разрешить - 0).

source: // is 1 because in our list of ports (configured by invocation of
ru_ru: // равен 1, потому что в нашем списке портов (сформированном вызовом

source: English
ru_ru: Английский

source: All circuits fall into one of two well-known categories: In a combinational circuit, all circuit outputs are a strict combination of the current circuit inputs, whereas in a sequential circuit, some outputs may depend on past inputs (the sequence of inputs over time).
ru_ru: Все схемы попадают под одну из двух хорошо известных категорий: в комбинационных схемах состояния всех выходов схемы - строгая комбинация текущих состояний входов схемы, тогда как в последовательностных схемах состояния некоторых выходов могут зависеть от прошлых состояний входов (последовательности состояний входов во времени).

source: You must make sure that they, too, receive or can get the source code.
ru_ru: Вы должны гарантировать, что они тоже получат или смогут получить исходный код.

source: Thus, you can take two priority encoders and connect the enable output of the first to the enable input of the second: If any of the indexed inputs to the first are 1, then the second will be disabled and so its output will be all floating.
ru_ru: Таким образом, можно взять два шифратора приоритетов и подключить разрешающий выход первого к разрешающему входу второго: если какой-либо из нумерованных входов первого содержит 1, то второй будет отключен, и поэтому его выход будет плавающим.

source: (Wires are ignored if there are any non-wires in the selection.) Changes to the attribute value affect all selected components.
ru_ru: (Провода игнорируются, если в выделении есть что-то кроме проводов.) Изменения значения атрибута влияют на все выбранные компоненты.

source: Save
ru_ru: Сохранить

source: This can be useful when you want to step the clocks manually, particularly when the clock is not in the same circuit that you are currently viewing.
ru_ru: Это может быть полезно, если вы хотите проходить такты тактовых генераторов вручную, особенно когда тактовый генератор не в той схеме, что вы рассматриваете в данный момент.

source: The value of the Shared Label attribute will be drawn in the rectangle's center; the Shared Label Facing attribute customizes which direction the text is drawn, and of course the Shared Label Font attribute customizes the font used.
ru_ru: Значение атрибута Общая метка будет отображено в центре прямоугольника; атрибут Направление общей метки определяет, в каком направлении отрисовывается текст, и конечно, атрибут Шрифт общей метки определяет используемый шрифт.

source: * a red rectangle around the value.
ru_ru: * красный прямоугольник вокруг значения.

source: 2.5.0 (in Base library, moved to Wiring in 2.7.0)
ru_ru: 2.5.0 (в библиотеке Базовые, перемещён в библиотеку Проводка в 2.7.0)

source: (On Mac OS systems, this will appear in the Logisim menu.)
ru_ru: (На системах с Mac OS появится в меню Logisim.)

source: The bit width of each individual value in memory.
ru_ru: Разрядность каждого отдельного значения в памяти.

source: Note that only the most recent 400 rows are displayed.
ru_ru: Обратите внимание, что отображаются только последние 400 строк.

source: Shift-clicking the mouse within a component toggles that component's presence within the selection.
ru_ru: Нажатие мыши с зажатой клавишей Shift внутри компонента переключает присутствие/отсутствие компонента в выделении.

source: Pressing the mouse button into the component gives keyboard focus to the component, and a vertical-bar cursor will be displayed.
ru_ru: Нажатие кнопки мыши на компоненте даёт ему фокус ввода клавиатуры, и отображается вертикальный курсор.

source: // component may be pushing a value onto the same point, which would
ru_ru: // компонент может записывать значение в эту же точку, и это

source: // variables, then of course we would need to clone them.
ru_ru: // то, конечно, нам пришлось бы клонировать их.

source: Label Color
ru_ru: Цвет метки

source: It also customizes the icon that appears in the explorer, associated with the tool.
ru_ru: Он также настраивает значок в проводнике, связанный с этим инструментом.

source: Controls the lower vertical segment on the right side.
ru_ru: Управляет нижним вертикальным сегментом на правой стороне.

source: It can't appear directly within a circuit multiple times, but it can appear multiple times if it appears in a subcircuit that is used several times.
ru_ru: Он не может появиться в схеме несколько раз непосредственно, но он может появиться несколько раз, если он встречается в подсхеме, которая используется несколько раз.

source: The order of the parameters is not important (except the table parameter must be immediately after -tty, and the memory image's filename must be immediately after -load).
ru_ru: Порядок параметров не имеет значения (за исключением того, что аргумент table должен идти сразу после -tty, и имя файла образа памяти должно идти сразу после -load).

source: The component's output, which will be floating if the control input is 0 or floating, the error value if the control input is the error value, and will be computed based on the west-side input if the control input is 1.
ru_ru: Выход компонента, значение на котором будет плавающим, если на управляющем входе 0 или плавающее значение; значение ошибки, если на управляющем входе значение ошибки; или будет вычислено на основе значения западного входа, если на управляющем входе 1.

source: The Bit Width In attribute specifies the bit width of the combined end.
ru_ru: Атрибут Разрядность входа определяет разрядность объединённого конца.

source: A button has only one pin, a 1-bit output, which is 0 except when the user is pressing the button using the Poke Tool, when it is 1.
ru_ru: Кнопка имеет только один контакт, 1-битный выход, значение которого 0 за исключением случая, когда пользователь нажимает кнопку Инструментом Нажатие - тогда на выходе 1.

source: Each port object says where to find the port relative to
ru_ru: Каждый объект Port говорит, где искать порт относительно

source: Selects the color of a pixel when it is lit.
ru_ru: Определяет цвет горящих пикселей.

source: Below this is a list of attributes for the tool currently selected in the list of mappings.
ru_ru: Ниже - список атрибутов для инструмента, выбранного в списке привязок.

source: Next: Library Class.
ru_ru: Далее: Класс Library.

source: Extension Type
ru_ru: Тип расширения

source: Subsequent values list the values in hexadecimal, starting from address 0; you can place several such values on the same line.
ru_ru: Последующие значения перечисляют значения в шестнадцатеричной форме, начиная с адреса 0; вы можете разместить несколько таких значений на одной строке.

source: For example, if you want to create new wires by shift-dragging, then you would first select the Wiring Tool in the Explorer (under the Base library); and then you would shift-click where it says "Click Using Combination To Map Wiring Tool." If that combination is already being used, then the mapping would be replaced with the new tool.
ru_ru: Например, если вы хотите создавать новые провода перетаскиванием мыши с зажатой Shift, то выберите Инструмент Проводка в проводнике (в библиотеке Базовые); дальше вам нужно щёлкнуть с клавишей Shift там, где написано "Щёлкните здесь используя комбинацию, чтобы привязать Инструмент Проводка". Если это сочетание уже используется, то привязка будет заменена новым инструментом.

source: This is the purpose for Logisim's logging module, which allows you to select components whose values should be logged; optionally, you can specify a file into which the log should be placed.
ru_ru: Это задача для модуля ведения журнала Logisim, который позволяет вам выбрать компоненты, чьи значения должны быть записаны в журнал; по желанию, вы можете указать файл, в который будет помещён журнал.

source: Note that the clock cycle speed will be slower than the tick speed: The fastest possible clock will have a one-tick up cycle and a one-tick down cycle; such a clock would have up/down cycle rate of 4 Hz if the ticks occur at 8 Hz.
ru_ru: Обратите внимание, что скорость циклов тактовых генераторов будет медленнее, чем скорость тактов: наиболее быстрый возможный тактовый генератор будет иметь один такт нарастания и один такт спада за цикл; такой тактовый генератор будет иметь скорость цикла нарастания/спада в 4 Гц, если такты происходят с частотой 8 Гц.

source: TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION
ru_ru: ОПРЕДЕЛЕНИЯ И УСЛОВИЯ ДЛЯ КОПИРОВАНИЯ, РАСПРОСТРАНЕНИЯ И МОДИФИКАЦИИ.

source: Controls the middle horizontal segment.
ru_ru: Управляет средним горизонтальным сегментом.

source: Some rows may have empty entries if the corresponding component was not in the selection at the time that the row was computed.
ru_ru: Некоторые строки могут иметь пустые записи, если соответствующий компонент не был в выборке в то время, когда строка была вычислена.

source: Show tick rate: If checked, then when ticks are enabled, Logisim displays a measurement of the rate at which it has been able to complete ticks.
ru_ru: Показать скорость тактов: если выбрано, то когда такты включены, Logisim отображает скорость, с которой он выполняет такты.

source: Go In To State
ru_ru: Состояние уровнем ниже

source: Logisim automatically connects wires to the gates and to each other.
ru_ru: Logisim автоматически подключает провода к элементам и друг к другу.

source: If you wish to incorporate parts of the Program into other free programs whose distribution conditions are different, write to the author to ask for permission.
ru_ru: Если вы хотите встроить части Программы в другие свободные программы с иными условиями распространения, напишите автору с просьбой о разрешении.

source: Select input: The value of this input determines to which output on the east edge to route the value received on the west edge.
ru_ru: Выбирающий вход: значение этого входа определяет, на какой выход на восточном крае будет перенаправлен вход на западном крае.

source: Note that the latter two options are unavailable for T and J-K flip-flops.
ru_ru: Обратите внимание, что два последних варианта недоступны для T и J-K триггеров.

source: In the explorer pane, you can now see that the project now contains two circuits, "main", and "2:1 MUX." Logisim draws a magnifying glass over the icon of the circuit currently being viewed; the current circuit name also appears in the window's title bar.
ru_ru: В панели проводника вы можете видеть, что проект теперь содержит две схемы, "main" и "2:1 MUX". Logisim отрисовывает увеличительное стекло поверх значка схемы, рассматриваемой в данный момент; ещё, название этой схемы появляется в заголовке окна.

source: If while searching for the desired value, a value that is neither 0 or 1 is found (the bit could be floating or an error value), then both outputs will consist entirely of error bits.
ru_ru: Если во время поиска желаемого значения найдено значение, не являющееся ни 0, ни 1 (бит плавающий или содержит значение ошибки), то оба выходных значения будут полностью состоять из битов со значением ошибки.

source: The location of this pin is specified in the Facing attribute.
ru_ru: Расположение этого контакта определяется атрибутом Направление.

source: Open Recent
ru_ru: Открыть недавние

source: (Any bits beyond the top are filled in with 0.) The select input will be a two-bit number that selects which of these three groups to output; if the select input is 3, then 000 will be the output.
ru_ru: (Все биты за пределами верхней границы заполняются нулями.) Выбирающий вход будет 2-разрядным номером, который выбирает, какая из этих трех групп посылается на выход; если на выбирающем входе 3, то на выходе будет 000.

source: The Greek translation was introduced with Logisim 2.7.0 and remains current.
ru_ru: Греческий перевод был представлен в Logisim 2.7.0 и остаётся актуальным.

source: Some keys have an effect with the Edit Tool.
ru_ru: Некоторые клавиши имеют эффект с Инструментом Правка.

source: Project Options
ru_ru: Параметры проекта

source: Opens the help system to the Library Reference.
ru_ru: Открывает справочную систему на Справке по библиотеке.

source: The menu item is enabled only when editing the circuit's appearance.
ru_ru: Этот пункт меню включен только при редактировании внешнего вида схемы.

source: Revert To Default Appearance
ru_ru: Вернуть внешний вид по умолчанию

source: Selects which of the values are currently being accessed by the circuit.
ru_ru: Выбирает, к какому значению схема в данный момент получает доступ.

source: In particular, an R-S latch built using two NOR gates will oscillate without this randomness, as both gates will process their inputs in lockstep.
ru_ru: Например, R-S триггер, построенный с использованием двух элементов ИЛИ-НЕ, будет возбуждаться без этой случайности, так как оба элемента будут обрабатывать свои входы "нога в ногу".

source: Wires that connect incompatible locations (drawn in orange) do not carry values.
ru_ru: Провода, которые соединяют несовместимые участки (отрисованные оранжевым), не передают значения.

source: When you change the input value, Logisim will show you what values travel down the wires by drawing them light green to indicate a 1 value or dark green (almost black) to indicate a 0 value.
ru_ru: Когда вы меняете входное значение, Logisim покажет вам, что значения путешествуют по проводам, отрисовывая их светло-зелёным, чтобы обозначить значение 1, или тёмно-зелёным (почти чёрным) чтобы обозначить значение 0.

source: Logisim will prevent you from unloading libraries that contain components used in a circuit, that appear in the toolbar, or that are mapped to a mouse button.
ru_ru: Logisim предостережёт вас от выгрузки библиотек, которые содержат компоненты, используемые в схеме, присутствующие в панели инструментов, или привязанные к кнопке мыши.

source: * An asterisk marks pins that exist only when the Parallel Load attribute is enabled.
ru_ru: * Звёздочкой отмечены контакты, существующие только когда атрибут Параллельная загрузка включен.

source: * east edge.
ru_ru: * восточного края.

source: The value at the currently selected address will be displayed in inverse text (white on black).
ru_ru: Значение выбранного в данный момент адреса будет отображаться негативным текстом (белым по чёрному).

source: In fact, the input pin and output pin tools in the default toolbar are both instances of the Wiring library's Pin tool, but the attribute sets are different.
ru_ru: На самом деле, инструменты Входной контакт и Выходной контакт на панели инструментов по умолчанию являются экземплярами инструмента Контакт библиотеки Проводка, но наборы атрибутов у них различны.

source: Next: The Mouse tab.
ru_ru: Далее: Вкладка Мышь.

source: South edge, second pin from left (input, bit width 1)
ru_ru: Южный край, второй контакт слева (вход, разрядность равна 1)

source: The component's source input that will transmit to the output if triggered by the p-gate and n-gate inputs.
ru_ru: Вход исток компонента, значение с которого будет передано на выход, если это инициировано входами p-затвор и n-затвор.

source: b) You must cause any work that you distribute or publish, that in
ru_ru: b) Вы обязаны предоставить всем третьим лицам лицензию на бесплатное использование каждого произведения, которое вы распространяете или публикуете,

source: The bit width of the values to be subtracted and of the result.
ru_ru: Разрядность значений для вычитания и результата.

source: Close
ru_ru: Закрыть

source: When Logisim detects oscillation, it shuts down all further simulation.
ru_ru: Когда Logisim обнаруживает возбуждение, он останавливает дальнейшее моделирование.

source: Next: Gray Code Incrementer.
ru_ru: Далее: Инкрементатор кода Грея.

source: The two gate inputs are drawn as lines connected to plates parallel to each of the plates connecting source to drain.
ru_ru: Два входа затвор изображены как линии, соединённые с пластинами, параллельными каждой из пластин, соединяющих исток со стоком.
